server/benchmarks.yaml
config:
  target: "http://localhost:8891/api/v1/"
  phases:
    - duration: 10 # Kiểm tra trong 60 giây
      arrivalRate: 1000 # Số lượng yêu cầu mỗi giây
scenarios:
  - flow:
      - get:
          url: "/listings?page=1&limit=30" # Đổi URL này thành endpoint bạn muốn kiểm tra
# listings?page=0&limit=1000